Перем _Конфигурация; // КонфигурацияБейджа
Перем _БазовыйКалькулятор; // КалькуляторГеометрииБейджа

Процедура ПриСозданииОбъекта(Конфигурация)
	_Конфигурация = Конфигурация;
	_БазовыйКалькулятор = Новый КалькуляторГеометрииБейджа(Конфигурация);
КонецПроцедуры

#Область ПрограммныйИнтерфейс

Функция Ширина() Экспорт
	Возврат _БазовыйКалькулятор.Нормализировать(ШиринаОбластиЛоготипа() + ШиринаЗаголовка() + ШиринаЗначения() + ШиринаСтрелки());
КонецФункции

Функция ПозицияРазделения() Экспорт
	Возврат _БазовыйКалькулятор.Нормализировать(Ширина() - ШиринаЗначения() - ШиринаСтрелки());
КонецФункции

Функция ПозицияЗаголовка() Экспорт
	Возврат _БазовыйКалькулятор.Нормализировать(ШиринаЗаголовка() / 2 + ШиринаОбластиЛоготипа());
КонецФункции

Функция ПозицияЗначения() Экспорт
	Возврат _БазовыйКалькулятор.Нормализировать(ПозицияРазделения() + ШиринаЗначения() / 2 + 6);
КонецФункции

Функция ШиринаЗаголовка() Экспорт

	Ширина = ДлинаТекстаЗаголовка();
	Если Ширина = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Макс(_БазовыйКалькулятор.Нормализировать(Ширина + 2 * _БазовыйКалькулятор.ОтступЗаголовка()), 11);

КонецФункции

Функция ШиринаЗначения() Экспорт
	Возврат _БазовыйКалькулятор.ШиринаЗначения();
КонецФункции

Функция ДлинаТекстаЗаголовка() Экспорт

	ДлинаТекстаЗаголовка = _БазовыйКалькулятор.ДлинаТекстаЗаголовка();

	Если ДлинаТекстаЗаголовка > 0 Тогда
		Возврат ДлинаТекстаЗаголовка;
	ИначеЕсли ШиринаОбластиЛоготипа() = 0 Тогда
		Возврат 10;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

Функция ДлинаТекстаЗначения() Экспорт
	Возврат _БазовыйКалькулятор.ДлинаТекстаЗначения();
КонецФункции

Функция ШиринаОбластиЛоготипа() Экспорт
	Возврат _БазовыйКалькулятор.ШиринаОбластиЛоготипа();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ШиринаСтрелки()
	Возврат ?(ШиринаЗначения() > 0, 6.5, 0);
КонецФункции

#КонецОбласти