Перем _Конфигурация; // КонфигурацияБейджа

Процедура ПриСозданииОбъекта(Конфигурация)
	_Конфигурация = Конфигурация;
КонецПроцедуры

#Область ПрограммныйИнтерфейс

Функция Ширина() Экспорт
	Возврат Нормализировать(ШиринаОбластиЛоготипа() + ШиринаЗаголовка() + ШиринаЗначения());
КонецФункции

Функция ПозицияЗаголовка() Экспорт
	Возврат Нормализировать(ШиринаЗаголовка() / 2 + ШиринаОбластиЛоготипа());
КонецФункции

Функция ПозицияЗначения() Экспорт
	Возврат Нормализировать(ПозицияРазделения() + ШиринаЗначения() / 2);
КонецФункции

Функция ШиринаЗаголовка() Экспорт

	Ширина = ДлинаТекстаЗаголовка();
	Если Ширина = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Нормализировать(Ширина + 2 * ОтступЗаголовка());

КонецФункции

Функция ШиринаЗначения() Экспорт

	Ширина = ДлинаТекстаЗначения();
	Если Ширина = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Нормализировать(Ширина + 2 * ОтступЗначения());

КонецФункции

Функция ДлинаТекстаЗаголовка() Экспорт
	Возврат Нормализировать(ВычислительШириныТекста.РассчитатьШирину(_Конфигурация.ПредставлениеЗаголовка(), _Конфигурация.ШиринаСимволаЗаголовка));
КонецФункции

Функция ДлинаТекстаЗначения() Экспорт
	Возврат Нормализировать(ВычислительШириныТекста.РассчитатьШирину(_Конфигурация.ПредставлениеЗначения(), _Конфигурация.ШиринаСимволаЗначения));
КонецФункции

Функция ПозицияРазделения() Экспорт
	Возврат Нормализировать(Ширина() - ШиринаЗначения());
КонецФункции

Функция ШиринаОбластиЛоготипа() Экспорт

	Если Не ЗначениеЗаполнено(_Конфигурация.Логотип) Тогда
		Возврат 0;
	КонецЕсли;

	ЛевыйОтступ = ОбластиЛоготипа();
	ПравыйОтступ = ОбластиЛоготипа();

	Если ЗначениеЗаполнено(_Конфигурация.Заголовок) Тогда
		ПравыйОтступ = Макс(ПравыйОтступ - ОтступЗаголовка(), 0);
	КонецЕсли;

	Возврат _Конфигурация.ШиринаЛоготипа + ЛевыйОтступ + ПравыйОтступ;

КонецФункции

Функция ОбластиЛоготипа() Экспорт
	Возврат ?(ЗначениеЗаполнено(_Конфигурация.Логотип), _Конфигурация.ОтступЛоготипа, 0);
КонецФункции

Функция ОтступЗаголовка() Экспорт
	Возврат _Конфигурация.КоличествоСимволовОтступа * _Конфигурация.ШиринаСимволаЗаголовка;
КонецФункции

Функция ОтступЗначения() Экспорт
	Возврат _Конфигурация.КоличествоСимволовОтступа * _Конфигурация.ШиринаСимволаЗначения;
КонецФункции

Функция Нормализировать(Значение) Экспорт
	Возврат ?(Значение < 0, 0, Окр(Значение, 1));
КонецФункции

#КонецОбласти