#Использовать fs

Перем _Конфигурация; // КонфигурацияБейджа
Перем _КалькуляторГеометрииБейджа; // КалькуляторГеометрииБейджа
Перем _ЦветаПредопределенныхЛоготипов; // Соответствие

Процедура ПриСозданииОбъекта(Конфигурация)

	_Конфигурация = Конфигурация;

	ЗаполнитьЦветаПредопределенныхЛоготипов();

КонецПроцедуры

#Область ПрограммныйИнтерфейс

Функция Скомпоновать() Экспорт
	
	ИнициализироватьКалькуляторГеометрии();

	Макет = ЗагрузитьМакет();
	Контекст = ПодготовитьКонтекстМакета();

	ЗаполнитьМакет(Макет, Контекст);

	Возврат Макет;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ИнициализироватьКалькуляторГеометрии()
	
	Параметры = Новый Массив();
	Параметры.Добавить(_Конфигурация);

	_КалькуляторГеометрииБейджа = Новый(_Конфигурация.ТипКалькулятораГеометрии, Параметры);

КонецПроцедуры

Процедура ЗаполнитьЦветаПредопределенныхЛоготипов()
	
	_ЦветаПредопределенныхЛоготипов = Новый Соответствие();
	_ЦветаПредопределенныхЛоготипов.Вставить("onescript", "#5196D9");
	_ЦветаПредопределенныхЛоготипов.Вставить("onescript-plain", "#A6CCE1");

КонецПроцедуры

Функция ЗагрузитьМакет()
	
	КаталогСценария = ТекущийСценарий().Каталог;

	ПутьКМакету = ОбъединитьПути(КаталогСценария, СтрШаблон("../../../templates/%1.svg", _Конфигурация.Стиль));

	Если Не ФС.ФайлСуществует(ПутьКМакету) Тогда
		ВызватьИсключение СтрШаблон("Не найден макет %1", _Конфигурация.Стиль);
	КонецЕсли;

	ЧтениеТекста = Новый ЧтениеТекста(ПутьКМакету);
	Макет = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Возврат Макет;

КонецФункции

Процедура ЗаполнитьМакет(Макет, Контекст)

	ПоискВыражений = Новый РегулярноеВыражение("\{\{\s*(.*?)\s*\}\}");
	ПоискВыражений.Многострочный = Истина;

	ПоискПараметров = Новый РегулярноеВыражение("\b[a-zA-Zа-яА-ЯЁё][a-zA-Zа-яА-ЯЁё0-9]*\b(?!\s*\()");

	НайденныеВыражения = ПоискВыражений.НайтиСовпадения(Макет);

	Поля = Новый Соответствие();
	Для Каждого НайденноеВыражение Из НайденныеВыражения Цикл
		
		СтрокаПоискаВыражения = НайденноеВыражение.Значение;
		Выражение = НайденноеВыражение.Группы[1].Значение;
		ЧастиВыражения = Новый Массив();
		Значение = Неопределено;
		ПредыдущийИндекс = -1;

		НайденныеПараметры = ПоискПараметров.НайтиСовпадения(Выражение);
		
		Для Каждого НайденныйПараметр Из НайденныеПараметры Цикл

			ИмяПараметра = НайденныйПараметр.Значение;
			
			Если Выражение = ИмяПараметра Тогда

				Если Не Контекст.Свойство(ИмяПараметра) Тогда
					Продолжить;
				КонецЕсли;

				Значение = Контекст[ИмяПараметра];

			Иначе

				Если НайденныйПараметр.Индекс > 0 Тогда
					ЧастиВыражения.Добавить(Сред(Выражение, ПредыдущийИндекс + 1, НайденныйПараметр.Индекс - Макс(ПредыдущийИндекс, 0)));
				КонецЕсли;

				ЧастиВыражения.Добавить("Контекст." + ИмяПараметра);

				ПредыдущийИндекс = НайденныйПараметр.Индекс + НайденныйПараметр.Длина;

			КонецЕсли;

		КонецЦикла;

		Если ПредыдущийИндекс > 0 Тогда
			ЧастиВыражения.Добавить(Сред(Выражение, ПредыдущийИндекс + 1));
		КонецЕсли;

		Выражение = СтрСоединить(ЧастиВыражения, "");

		Если Значение = Неопределено Тогда
			Значение = Вычислить(Выражение);
		КонецЕсли;

		Макет = СтрЗаменить(Макет,
			СтрокаПоискаВыражения,
			Формат(Значение, "ЧРД=.; ЧГ="));

	КонецЦикла;

КонецПроцедуры

Функция ПодготовитьКонтекстМакета()

	МасштабТекста = _Конфигурация.МасштабТекста;

	Контекст = Новый Структура();
	Контекст.Вставить("Подсказка",              ПолучитьПодсказку());
	Контекст.Вставить("Логотип",                ПодготовитьЛоготипDataURL());
	Контекст.Вставить("Заголовок",              _Конфигурация.ПредставлениеЗаголовка());
	Контекст.Вставить("Значение",               _Конфигурация.ПредставлениеЗначения());
	Контекст.Вставить("ЦветТекстаЗаголовка",    _Конфигурация.ЦветТекстаЗаголовка);
	Контекст.Вставить("ЦветТекстаЗначения",     _Конфигурация.ЦветТекстаЗначения);
	Контекст.Вставить("ЦветФонаЗаголовка",      _Конфигурация.ЦветФонаЗаголовка);
	Контекст.Вставить("ЦветФонаЗначения",       _Конфигурация.ЦветФонаЗначения);
	Контекст.Вставить("ЦветТениЗаголовка",      _Конфигурация.ЦветТениЗаголовка);
	Контекст.Вставить("ЦветТениЗначения",       _Конфигурация.ЦветТениЗначения);
	Контекст.Вставить("СсылкаЗаголовка",        _Конфигурация.СсылкаЗаголовка);
	Контекст.Вставить("СсылкаЗначения",         _Конфигурация.СсылкаЗначения);
	Контекст.Вставить("РазмерШрифта",           _Конфигурация.РазмерШрифта / МасштабТекста);
	Контекст.Вставить("Ширина",                 _КалькуляторГеометрииБейджа.Ширина());
	Контекст.Вставить("ШиринаОбластиЛоготипа",  _КалькуляторГеометрииБейджа.ШиринаОбластиЛоготипа());
	Контекст.Вставить("ШиринаЗаголовка",        _КалькуляторГеометрииБейджа.ШиринаЗаголовка());
	Контекст.Вставить("ШиринаЗначения",         _КалькуляторГеометрииБейджа.ШиринаЗначения());
	Контекст.Вставить("ДлинаТекстаЗаголовка",   _КалькуляторГеометрииБейджа.ДлинаТекстаЗаголовка() / МасштабТекста);
	Контекст.Вставить("ДлинаТекстаЗначения",    _КалькуляторГеометрииБейджа.ДлинаТекстаЗначения() / МасштабТекста);
	Контекст.Вставить("ПозицияРазделения",      _КалькуляторГеометрииБейджа.ПозицияРазделения());
	Контекст.Вставить("ПозицияЗаголовка",       _КалькуляторГеометрииБейджа.ПозицияЗаголовка() / МасштабТекста);
	Контекст.Вставить("ПозицияЗначения",        _КалькуляторГеометрииБейджа.ПозицияЗначения() / МасштабТекста);

	Возврат Контекст;
	
КонецФункции

Функция ПолучитьПодсказку()

	Части = Новый Массив();

	Если ЗначениеЗаполнено(_Конфигурация.Заголовок) Тогда
		Части.Добавить(_Конфигурация.ПредставлениеЗаголовка());
	КонецЕсли;

	ТекстЗначения = _Конфигурация.ПредставлениеЗначения();
	Если ЗначениеЗаполнено(ТекстЗначения) Тогда
		Если Части.Количество() > 0 Тогда
			Части.Добавить(": ");
		КонецЕсли;
		Части.Добавить(ТекстЗначения);
	КонецЕсли;

	Возврат СтрСоединить(Части);

КонецФункции

Функция ПодготовитьЛоготипDataURL()

	Логотип = _Конфигурация.Логотип;
	Цвет = _Конфигурация.ЦветЛоготипа;
	
	Если Не ЗначениеЗаполнено(Логотип) Тогда
		Возврат "";
	ИначеЕсли ЭтоDataURL(Логотип) Тогда
		Возврат ПодготовитьЛоготипПоDataURL(Логотип, Цвет);
	ИначеЕсли ЭтоBase64(Логотип) Тогда
		Возврат ПодготовитьЛоготипПоBase64(Логотип, Цвет);
	Иначе
		Возврат ПодготовитьПредопределенныйЛоготип(Логотип, Цвет);
	КонецЕсли;
	
КонецФункции

Функция ПодготовитьЛоготипПоDataURL(DataURL, Цвет)

	Если Не ЗначениеЗаполнено(Цвет) Тогда
		Возврат DataURL;
	КонецЕсли;
	
	Если Не СтрНачинаетсяС(DataURL, ПрефиксDataURL()) Тогда
		Возврат DataURL;
	КонецЕсли;

	Base64 = Сред(DataURL, СтрДлина(ПрефиксDataURL()) + 1);

	Возврат ПодготовитьЛоготипПоBase64(Base64, Цвет);
	
КонецФункции

Функция ПодготовитьЛоготипПоBase64(Знач Base64, Цвет)

	Если ЗначениеЗаполнено(Цвет) Тогда
		SVG = ПолучитьКодЛоготипаИзBase64(Base64);
		SVG = УстановитьЦветЛоготипа(SVG, Цвет);
		Base64 = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(SVG));
	КонецЕсли;

	Возврат DataURLИзBase64(Base64);

КонецФункции

Функция ПодготовитьПредопределенныйЛоготип(ИмяЛоготипа, Знач Цвет)

	КаталогСценария = ТекущийСценарий().Каталог;

	ПутьКФайлу = ОбъединитьПути(КаталогСценария, СтрШаблон("../../../assets/icons/%1.svg", НРег(ИмяЛоготипа)));

	Если Не ФС.ФайлСуществует(ПутьКФайлу) Тогда
		ВызватьИсключение СтрШаблон("Не найден логотип с именем %1", ИмяЛоготипа);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Цвет) Тогда
		Цвет = _ЦветаПредопределенныхЛоготипов[НРег(ИмяЛоготипа)];
	КонецЕсли;

	Если ЗначениеЗаполнено(Цвет) Тогда
		SVG = ПолучитьСтрокуИзДвоичныхДанных(Новый ДвоичныеДанные(ПутьКФайлу));
		SVG = УстановитьЦветЛоготипа(SVG, Цвет);
		Base64 = Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(SVG));
	Иначе
		Base64 = Base64Строка(Новый ДвоичныеДанные(ПутьКФайлу));
	КонецЕсли;

	Возврат DataURLИзBase64(Base64);

КонецФункции

Функция ПолучитьКодЛоготипаИзBase64(Base64)
	Возврат ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Base64));
КонецФункции

Функция УстановитьЦветЛоготипа(SVG, Цвет)
	РегулярноеВыражение = Новый РегулярноеВыражение("(<svg\b[^>]*>)([\s\S]*?)(</svg>)");
	Возврат РегулярноеВыражение.Заменить(SVG, СтрШаблон("$1<g fill=""%1"">$2</g>$3", Цвет));
КонецФункции

Функция ЭтоDataURL(Текст)
	Возврат СтрНачинаетсяС(Текст, "data:image");
КонецФункции

Функция ЭтоBase64(Текст)
	
	Попытка
		Base64Значение(Текст);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция DataURLИзBase64(Base64)
	Возврат "" + ПрефиксDataURL() + Base64;
КонецФункции

Функция ПрефиксDataURL()
	Возврат "data:image/svg+xml;base64,";
КонецФункции

#КонецОбласти