#Использовать asserts
#Использовать tempfiles
#Использовать "../src/core"

&ПослеВсех
Процедура ПослеЗапускаТестов() Экспорт
	ВременныеФайлы.Удалить();
КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьГенерациюБейджа() Экспорт
	
	Стили = Новый Массив();
	Стили.Добавить(СтилиБейджей.Flat);
	Стили.Добавить(СтилиБейджей.FlatSquare);
	Стили.Добавить(СтилиБейджей.ForTheBadge);
	Стили.Добавить(СтилиБейджей.Social);
	Стили.Добавить(СтилиБейджей.GitlabScoped);

	ТестовыеСлучаи = ТестовыеСлучаиКонфигурации();

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Для Каждого ИмяСтиля Из Стили Цикл

			// Подготовка
			Конфигурация = ТестовыйСлучай.Ключ;
			Конфигурация.Стиль = ИмяСтиля;

			ПутьКФайлуЭталон = ПолучитьПутьКЭталонномуБейджу(ТестовыйСлучай.Значение, ИмяСтиля);
			ПутьКФайлуТест = ВременныеФайлы.СоздатьФайл("svg");
			
			// Действие
			Бейдж = Новый Бейдж(Конфигурация);
			Бейдж.СохранитьВФайл(ПутьКФайлуТест);
		
			// Утверждение
			ОжидаемЧтоФайлыСовпадают(ПутьКФайлуЭталон, ПутьКФайлуТест, ТестовыйСлучай.Значение);

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИсключениеПриУстановкеКонфигурацииСНеподдерживаемымСтилем() Экспорт
	
	// Подготовка
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Стиль = "unknown";

	Бейдж = Новый Бейдж(Конфигурация);

	// Действие и Утверждение
	Ожидаем.Что(Бейдж)
		.Метод("ПолучитьSVG")
		.ВыбрасываетИсключение("Стиль unknown не поддерживается");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ИсключениеПриУстановкеНесуществующегоЛоготипа() Экспорт
	
	// Подготовка
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Логотип = "unknown";

	Бейдж = Новый Бейдж(Конфигурация);

	// Действие и Утверждение
	Ожидаем.Что(Бейдж)
		.Метод("ПолучитьSVG")
		.ВыбрасываетИсключение("Не найден логотип с именем unknown");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПрименитьКонфигурацию() Экспорт
	
	// Подготовка
	Бейдж = Новый Бейдж();
	Конфигурация = Новый КонфигурацияБейджа("label", "value", "red");

	ПутьКФайлуЭталон = ПолучитьПутьКЭталонномуБейджу("ЗаголовокЗначениеИЦвет", "flat");
	ПутьКФайлуТест = ВременныеФайлы.СоздатьФайл("svg");

	// Действие
	Бейдж.ПрименитьКонфигурацию(Конфигурация);
	Бейдж.СохранитьВФайл(ПутьКФайлуТест);

	// Утверждение
	ОжидаемЧтоФайлыСовпадают(ПутьКФайлуЭталон, ПутьКФайлуТест);

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьDataURL() Экспорт
	
	// Подготовка
	Бейдж = Новый Бейдж();

	// Действие
	Результат = Бейдж.ПолучитьDataURL();

	// Утверждение
	Ожидаем.Что(Результат).Содержит("data:image/svg+xml;base64,");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПолучитьBase64() Экспорт
	
	// Подготовка
	Бейдж = Новый Бейдж();

	// Действие
	Результат = Бейдж.ПолучитьBase64();

	// Утверждение
	Ожидаем.Что(ЭтоBase64(Результат)).ЭтоИстина();

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьИзменениеКонфигурации() Экспорт
	
	// Подготовка
	Конфигурация = Новый КонфигурацияБейджа("Старый");
	Бейдж = Новый Бейдж(Конфигурация);

	// Действие
	Бейдж.ПолучитьSVG();
	Конфигурация.Заголовок = "Новый";
	Результат = Бейдж.ПолучитьSVG();
	
	// Утверждение
	Ожидаем.Что(Результат).Содержит(">Новый</text>");

КонецПроцедуры

&Тест
Процедура ТестДолжен_ПроверитьУстановкуЦветаЛоготипа() Экспорт
	
	// Подготовка
	Логотипы = Новый Массив();
	Логотипы.Добавить(ЛоготипGithubBase64());
	Логотипы.Добавить("data:image/svg+xml;base64," + ЛоготипGithubBase64());

	Конфигурация = Новый КонфигурацияБейджа("label");
	Конфигурация.ЦветЛоготипа = "red";

	Бейдж = Новый Бейдж(Конфигурация);

	РегулярноеВыражение = Новый РегулярноеВыражение("data:image/svg\+xml;base64,([A-Za-z0-9+/=]+)");

	Для Каждого Логотип Из Логотипы Цикл

		Конфигурация.Логотип = Логотип;
		
		// Действие
		Результат = Бейдж.ПолучитьSVG();
		
		// Утверждение
		Совпадения = РегулярноеВыражение.НайтиСовпадения(Результат);
		Base64 = Совпадения[0].Группы[1].Значение;
		SVG = ПолучитьСтрокуИзДвоичныхДанных(Base64Значение(Base64));

		Ожидаем.Что(SVG).Содержит("xmlns=""http://www.w3.org/2000/svg""><g fill=""red""><title>");
		Ожидаем.Что(SVG).Содержит("</g></svg>");

	КонецЦикла

КонецПроцедуры

Функция ТестовыеСлучаиКонфигурации()

	Набор = Новый Соответствие();

	// Пустая конфигурация
	Конфигурация = Новый КонфигурацияБейджа();
	Набор.Вставить(Конфигурация, "ПустаяКонфигурация");

	// Заголовок
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Набор.Вставить(Конфигурация, "Заголовок");

	// Заголовок через конструктор
	Конфигурация = Новый КонфигурацияБейджа("label");
	Набор.Вставить(Конфигурация, "Заголовок");

	// Значение
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Значение = "value";
	Набор.Вставить(Конфигурация, "Значение");

	// Заголовок и значение
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Конфигурация.Значение = "value";
	Набор.Вставить(Конфигурация, "ЗаголовокИЗначение");

	// Заголовок и значение через конструктор
	Конфигурация = Новый КонфигурацияБейджа("label", "value");
	Набор.Вставить(Конфигурация, "ЗаголовокИЗначение");

	// Заголовок и значение на кириллице
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "Заголовок";
	Конфигурация.Значение = "Значение";
	Набор.Вставить(Конфигурация, "ЗаголовокИЗначениеНаКириллице");

	// Логотип
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Логотип = "onescript";
	Набор.Вставить(Конфигурация, "Логотип");

	// Логотип base64
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Логотип = ЛоготипGithubBase64();
	Набор.Вставить(Конфигурация, "ЛоготипBase64");

	// Логотип data-url
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Логотип = "data:image/svg+xml;base64," + ЛоготипGithubBase64();
	Набор.Вставить(Конфигурация, "ЛоготипDataURL");

	// Логотип и заголовок
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Конфигурация.Логотип = "onescript";
	Набор.Вставить(Конфигурация, "ЛоготипИЗаголовок");

	// Логотип, заголовок и значение
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Конфигурация.Значение = "value";
	Конфигурация.Логотип = "onescript";
	Набор.Вставить(Конфигурация, "ЛоготипЗаголовокИЗначение");

	// Значение и префикс
	Конфигурация = Новый КонфигурацияБейджа(, "2.0.0");
	Конфигурация.ПрефиксЗначения = "v";
	Набор.Вставить(Конфигурация, "ЗначениеИПрефикс");

	// Значение и суффикс
	Конфигурация = Новый КонфигурацияБейджа(, 100);
	Конфигурация.СуффиксЗначения = "%";
	Набор.Вставить(Конфигурация, "ЗначениеИСуффикс");

	// Цвета
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Конфигурация.Значение = "value";
	Конфигурация.ЦветТекстаЗаголовка = "red";
	Конфигурация.ЦветТениЗаголовка = "blue";
	Конфигурация.ЦветФонаЗаголовка = "yellow";
	Конфигурация.ЦветТекстаЗначения = "yellow";
	Конфигурация.ЦветТениЗначения = "red";
	Конфигурация.ЦветФонаЗначения = "blue";
	Набор.Вставить(Конфигурация, "Цвета");

	// Размер шрифта
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Конфигурация.Значение = "value";
	Конфигурация.РазмерШрифта = 8;
	Набор.Вставить(Конфигурация, "РазмерШрифта");

	// Ширина символа
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Конфигурация.Значение = "value";
	Конфигурация.ШиринаСимволаЗаголовка = 20;
	Конфигурация.ШиринаСимволаЗначения = 30;
	Набор.Вставить(Конфигурация, "ШиринаСимвола");

	// Количество смволов отступа
	Конфигурация = Новый КонфигурацияБейджа();
	Конфигурация.Заголовок = "label";
	Конфигурация.Значение = "value";
	Конфигурация.КоличествоСимволовОтступа = 10;
	Набор.Вставить(Конфигурация, "КоличествоСимволовОтступа");

	// Заголовок, значение и цвет через конструктор
	Конфигурация = Новый КонфигурацияБейджа("label", "value", "red");
	Набор.Вставить(Конфигурация, "ЗаголовокЗначениеИЦвет");

	Возврат Набор;
	
КонецФункции

Процедура ОжидаемЧтоФайлыСовпадают(Путь1, Путь2, Сообщение = "Файлы должны совпадать")

	ЧтениеТекста = Новый ЧтениеТекста(Путь1);
	Текст1 = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	ЧтениеТекста = Новый ЧтениеТекста(Путь2);
	Текст2 = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();

	Ожидаем.Что(Текст1, Сообщение).Равно(Текст2);

КонецПроцедуры

Процедура СформироватьЭталонныеФайлы()
	
	Стили = Новый Массив();
	Стили.Добавить(СтилиБейджей.Flat);
	Стили.Добавить(СтилиБейджей.FlatSquare);
	Стили.Добавить(СтилиБейджей.ForTheBadge);
	Стили.Добавить(СтилиБейджей.Social);
	Стили.Добавить(СтилиБейджей.GitlabScoped);

	ТестовыеСлучаи = ТестовыеСлучаиКонфигурации();

	Для Каждого ТестовыйСлучай Из ТестовыеСлучаи Цикл

		Для Каждого ИмяСтиля Из Стили Цикл

			Конфигурация = ТестовыйСлучай.Ключ;
			Конфигурация.Стиль = ИмяСтиля;

			ПутьКФайлу = ПолучитьПутьКЭталонномуБейджу(ТестовыйСлучай.Значение, ИмяСтиля);
		
			Бейдж = Новый Бейдж(Конфигурация);
			Бейдж.СохранитьВФайл(ПутьКФайлу);

		КонецЦикла;

	КонецЦикла;

КонецПроцедуры

Функция ПолучитьПутьКЭталонномуБейджу(Имя, Стиль)
	Возврат СтрШаблон("./tests/fixtures/%1-%2.svg", Имя, Стиль)
КонецФункции

Функция ЭтоBase64(Текст)
	
	Попытка
		Base64Значение(Текст);
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;

КонецФункции

Функция ЛоготипGithubBase64()
	Возврат "PHN2ZyBmaWxsPSJ3aGl0ZXNtb2tlIiByb2xlPSJpbWciIHZpZXdCb3g9IjAgMCAyNCAyNCIgeG1sbnM9Imh0dHA6Ly93d3cudzMub3JnLzIwMDAvc3ZnIj48dGl0bGU+R2l0SHViPC90aXRsZT48cGF0aCBkPSJNMTIgLjI5N2MtNi42MyAwLTEyIDUuMzczLTEyIDEyIDAgNS4zMDMgMy40MzggOS44IDguMjA1IDExLjM4NS42LjExMy44Mi0uMjU4LjgyLS41NzcgMC0uMjg1LS4wMS0xLjA0LS4wMTUtMi4wNC0zLjMzOC43MjQtNC4wNDItMS42MS00LjA0Mi0xLjYxQzQuNDIyIDE4LjA3IDMuNjMzIDE3LjcgMy42MzMgMTcuN2MtMS4wODctLjc0NC4wODQtLjcyOS4wODQtLjcyOSAxLjIwNS4wODQgMS44MzggMS4yMzYgMS44MzggMS4yMzYgMS4wNyAxLjgzNSAyLjgwOSAxLjMwNSAzLjQ5NS45OTguMTA4LS43NzYuNDE3LTEuMzA1Ljc2LTEuNjA1LTIuNjY1LS4zLTUuNDY2LTEuMzMyLTUuNDY2LTUuOTMgMC0xLjMxLjQ2NS0yLjM4IDEuMjM1LTMuMjItLjEzNS0uMzAzLS41NC0xLjUyMy4xMDUtMy4xNzYgMCAwIDEuMDA1LS4zMjIgMy4zIDEuMjMuOTYtLjI2NyAxLjk4LS4zOTkgMy0uNDA1IDEuMDIuMDA2IDIuMDQuMTM4IDMgLjQwNSAyLjI4LTEuNTUyIDMuMjg1LTEuMjMgMy4yODUtMS4yMy42NDUgMS42NTMuMjQgMi44NzMuMTIgMy4xNzYuNzY1Ljg0IDEuMjMgMS45MSAxLjIzIDMuMjIgMCA0LjYxLTIuODA1IDUuNjI1LTUuNDc1IDUuOTIuNDIuMzYuODEgMS4wOTYuODEgMi4yMiAwIDEuNjA2LS4wMTUgMi44OTYtLjAxNSAzLjI4NiAwIC4zMTUuMjEuNjkuODI1LjU3QzIwLjU2NSAyMi4wOTIgMjQgMTcuNTkyIDI0IDEyLjI5N2MwLTYuNjI3LTUuMzczLTEyLTEyLTEyIi8+PC9zdmc+";
КонецФункции