#Использовать "../../internal"

Перем _Конфигурация; // КонфигурацияБейджа
Перем _ИсходнаяКонфигурация; // КонфигурацияБейджа
Перем _Компоновщик; // КомпоновщикМакетаБейджа

// Конструктор
//
// Параметры:
//   Конфигурация - КонфигурацияБейджа
Процедура ПриСозданииОбъекта(Конфигурация = Неопределено)

	_Конфигурация = Новый КонфигурацияБейджа();
	_Компоновщик = Новый КомпоновщикМакетаБейджа(_Конфигурация);

	Если Конфигурация = Неопределено Тогда
		Конфигурация = Новый КонфигурацияБейджа();
	КонецЕсли;

	ПрименитьКонфигурацию(Конфигурация);

КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Применяет конфигурацию
//
// Параметры:
//   Конфигурация - КонфигурацияБейджа
Процедура ПрименитьКонфигурацию(Конфигурация) Экспорт
	_ИсходнаяКонфигурация = Конфигурация;
КонецПроцедуры

// Возвращает готовый SVG-код бейджа.
//
// Возвращаемое значение:
//   Строка
Функция ПолучитьSVG() Экспорт
	
	ЗаполнитьЗначенияСвойств(_Конфигурация, _ИсходнаяКонфигурация);
	_Конфигурация.ПрименитьСтиль(_Конфигурация.Стиль);

	Возврат _Компоновщик.Скомпоновать();

КонецФункции

// Возвращает бейдж в формате Data URI
//
// Возвращаемое значение:
//   Строка 
Функция ПолучитьDataURL() Экспорт
	Возврат "data:image/svg+xml;base64," + ПолучитьBase64();
КонецФункции

// Возвращает SVG бейджа, закодированный в Base64
//
// Возвращаемое значение:
//   Строка 
Функция ПолучитьBase64() Экспорт
	Возврат Base64Строка(ПолучитьДвоичныеДанныеИзСтроки(ПолучитьSVG()));
КонецФункции

// Сохраняет SVG бейджа в указанный файл на диске
//
// Параметры:
//   ПутьКФайлу - Строка - Полный путь к файлу, в который будет записан SVG
Процедура СохранитьВФайл(ПутьКФайлу) Экспорт

	ЗаписьТекста = Новый ЗаписьТекста(ПутьКФайлу);
	ЗаписьТекста.Записать(ПолучитьSVG());
	ЗаписьТекста.Закрыть();

КонецПроцедуры

#КонецОбласти