// Соответствие из КлючИЗначение:
//   * Ключ - Строка - Символ
//   * Значение - Число - Коэффициент от базовой ширины символа шрифта
Перем _КоэффициентыШириныПоСимволам;

Функция РассчитатьШирину(Текст, ШиринаШрифта) Экспорт

	Размер = 0;
	КоэффициентПоУмолчанию = 0.5;

	Если _КоэффициентыШириныПоСимволам = Неопределено Тогда
		ЗаполнитьКоэффициентыШириныПоСимволам();
	КонецЕсли;

	Для НомерСимвола = 1 По СтрДлина(Текст) Цикл
	
		Символ = Сред(Текст, НомерСимвола, 1);
		Коэффициент = _КоэффициентыШириныПоСимволам[Символ];

		Если Коэффициент = Неопределено Тогда
			Коэффициент = КоэффициентПоУмолчанию;
		КонецЕсли;

		Размер = Размер + Коэффициент * ШиринаШрифта;

	КонецЦикла;

	Возврат Размер;
	
КонецФункции

Процедура ЗаполнитьКоэффициентыШириныПоСимволам()

	КоэффициентыШириныСимволов = Новый Соответствие();
	КоэффициентыШириныСимволов.Вставить("@%mMW", 1.00);
	КоэффициентыШириныСимволов.Вставить("GOQБЖФЩЪЮ", 0.90);
	КоэффициентыШириныСимволов.Вставить("0689ABCDEgHKNPqRSTuUVwXYАВГДЗИКЛНОПРСТУФХЦЧШЫЬЭЯ", 0.80);
	КоэффициентыШириныСимволов.Вставить("?+<=>~abdeFhLnopryZабвгдежзкмнопуфхцчшщъыьэюя", 0.70);
	КоэффициентыШириныСимволов.Вставить("-!()[]{}*`^1234567cfJkrsvxyzбдзийклнрстуш", 0.60);
	КоэффициентыШириныСимволов.Вставить(" ,;:.'""/\`|iIjltгзїь", 0.40);

	_КоэффициентыШириныПоСимволам = Новый Соответствие();

	Для Каждого СтрокаКоэффициента Из КоэффициентыШириныСимволов Цикл

		ПереченьСимволов = СтрокаКоэффициента.Ключ;
		Коэффициент = СтрокаКоэффициента.Значение;

		Для НомерСимвола = 1 По СтрДлина(ПереченьСимволов) Цикл
			Символ = Сред(ПереченьСимволов, НомерСимвола, 1);
			_КоэффициентыШириныПоСимволам.Вставить(Символ, Коэффициент);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры