// Соответствие из КлючИЗначение:
//   * Ключ - Строка - Символ
//   * Значение - Число - Коэффициент от базовой ширины символа шрифта
Перем _КоэффициентыШириныПоСимволам;

Функция РассчитатьШирину(Текст, ШиринаШрифта) Экспорт

	Размер = 0;
	КоэффициентПоУмолчанию = 0.5;

	Если _КоэффициентыШириныПоСимволам = Неопределено Тогда
		ЗаполнитьКоэффициентыШириныПоСимволам();
	КонецЕсли;

	Для НомерСимвола = 1 По СтрДлина(Текст) Цикл
	
		Символ = Сред(Текст, НомерСимвола, 1);
		Коэффициент = _КоэффициентыШириныПоСимволам[Символ];

		Если Коэффициент = Неопределено Тогда
			Коэффициент = КоэффициентПоУмолчанию;
		КонецЕсли;

		Размер = Размер + Коэффициент * ШиринаШрифта;

	КонецЦикла;

	Возврат Размер;
	
КонецФункции

Процедура ЗаполнитьКоэффициентыШириныПоСимволам()

	КоэффициентыШириныСимволов = Новый Соответствие();
	КоэффициентыШириныСимволов.Вставить("№", 1.3);
	КоэффициентыШириныСимволов.Вставить("%", 1.2);
	КоэффициентыШириныСимволов.Вставить("Wm@ЖШЩЮ", 1.1);
	КоэффициентыШириныСимволов.Вставить("Ыщ", 1.0);
	КоэффициентыШириныСимволов.Вставить("MOQw#^+=<>~МОФжфшыю", 0.9);
	КоэффициентыШириныСимволов.Вставить("BCDGHKNRUX&БВДИЙКЛНПСХЦЧЪЭЯм", 0.8);
	КоэффициентыШириныСимволов.Вставить("AEPSTVYZabdeghnopqu0123456789$*_{}`АЕЁЗРТУЬабвдеёийлнопрцчъя", 0.7);
	КоэффициентыШириныСимволов.Вставить("FLcksvxyz?Гзксухьэ", 0.6);
	КоэффициентыШириныСимволов.Вставить("IJr()-[]|;:""\/гт", 0.5);
	КоэффициентыШириныСимволов.Вставить("fjt !,.", 0.4);
	КоэффициентыШириныСимволов.Вставить("il'", 0.3);

	_КоэффициентыШириныПоСимволам = Новый Соответствие();

	Для Каждого СтрокаКоэффициента Из КоэффициентыШириныСимволов Цикл

		ПереченьСимволов = СтрокаКоэффициента.Ключ;
		Коэффициент = СтрокаКоэффициента.Значение;

		Для НомерСимвола = 1 По СтрДлина(ПереченьСимволов) Цикл
			Символ = Сред(ПереченьСимволов, НомерСимвола, 1);
			_КоэффициентыШириныПоСимволам.Вставить(Символ, Коэффициент);
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры