// BSLLS:FunctionShouldHaveReturn-off

// Конструктор калькулятора геометрии бейджа
//
// Параметры:
//   Конфигурация - КонфигурацияБейджа - Конфигурация бейджа для расчета геометрии
Процедура ПриСозданииОбъекта(Конфигурация)
КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Вычисляет общую ширину бейджа
//
// Возвращаемое значение:
//   Число
Функция Ширина() Экспорт
КонецФункции

// Вычисляет координату границы между областями заголовка и значения
//
// Возвращаемое значение:
//   Число
Функция ПозицияРазделения() Экспорт
КонецФункции

// Вычисляет координату центра текста заголовка
//
// Возвращаемое значение:
//   Число
Функция ПозицияЗаголовка() Экспорт
КонецФункции

// Вычисляет координату центра текста значения
//
// Возвращаемое значение:
//   Число
Функция ПозицияЗначения() Экспорт
КонецФункции

// Вычисляет ширину области заголовка
//
// Возвращаемое значение:
//   Число
Функция ШиринаЗаголовка() Экспорт
КонецФункции

// Вычисляет ширину области значения
//
// Возвращаемое значение:
//   Число
Функция ШиринаЗначения() Экспорт
КонецФункции

// Вычисляет ширину текста заголовка
//
// Возвращаемое значение:
//   Число
Функция ШиринаТекстаЗаголовка() Экспорт
КонецФункции

// Вычисляет ширину текста значения
//
// Возвращаемое значение:
//   Число
Функция ШиринаТекстаЗначения() Экспорт
КонецФункции

// Вычисляет ширину области логотипа
//
// Возвращаемое значение:
//   Число
Функция ШиринаОбластиЛоготипа() Экспорт
КонецФункции

#КонецОбласти