Перем _БазовыйКалькулятор; // БазовыйКалькуляторГеометрииБейджа

// Конструктор калькулятора геометрии бейджа
//
// Параметры:
//   Конфигурация - КонфигурацияБейджа - Конфигурация бейджа для расчета геометрии
Процедура ПриСозданииОбъекта(Конфигурация)
	_БазовыйКалькулятор = Новый БазовыйКалькуляторГеометрииБейджа(Конфигурация);
КонецПроцедуры

#Область ПрограммныйИнтерфейс

// Вычисляет общую ширину бейджа
//
// Возвращаемое значение:
//   Число
Функция Ширина() Экспорт
	Ширина = ШиринаОбластиЛоготипа() + ШиринаЗаголовка() + ШиринаЗначения() + ШиринаСтрелки();
	Возврат _БазовыйКалькулятор.Нормализировать(Ширина);
КонецФункции

// Вычисляет координату границы между областями заголовка и значения
//
// Возвращаемое значение:
//   Число
Функция ПозицияРазделения() Экспорт
	Возврат _БазовыйКалькулятор.Нормализировать(Ширина() - ШиринаЗначения() - ШиринаСтрелки());
КонецФункции

// Вычисляет координату центра текста заголовка
//
// Возвращаемое значение:
//   Число
Функция ПозицияЗаголовка() Экспорт
	Возврат _БазовыйКалькулятор.Нормализировать(ШиринаЗаголовка() / 2 + ШиринаОбластиЛоготипа());
КонецФункции

// Вычисляет координату центра текста значения
//
// Возвращаемое значение:
//   Число
Функция ПозицияЗначения() Экспорт
	Возврат _БазовыйКалькулятор.Нормализировать(ПозицияРазделения() + ШиринаЗначения() / 2 + 6);
КонецФункции

// Вычисляет ширину области заголовка
//
// Возвращаемое значение:
//   Число
Функция ШиринаЗаголовка() Экспорт

	Ширина = ШиринаТекстаЗаголовка();
	Если Ширина = 0 Тогда
		Возврат 0;
	КонецЕсли;

	Возврат Макс(_БазовыйКалькулятор.Нормализировать(Ширина + 2 * _БазовыйКалькулятор.ОтступЗаголовка()), 11);

КонецФункции

// Вычисляет ширину области значения
//
// Возвращаемое значение:
//   Число
Функция ШиринаЗначения() Экспорт
	Возврат _БазовыйКалькулятор.ШиринаЗначения();
КонецФункции

// Вычисляет ширину текста заголовка
//
// Возвращаемое значение:
//   Число
Функция ШиринаТекстаЗаголовка() Экспорт

	ШиринаТекстаЗаголовка = _БазовыйКалькулятор.ШиринаТекстаЗаголовка();

	Если ШиринаТекстаЗаголовка > 0 Тогда
		Возврат ШиринаТекстаЗаголовка;
	ИначеЕсли ШиринаОбластиЛоготипа() = 0 Тогда
		Возврат 10;
	Иначе
		Возврат 0;
	КонецЕсли;

КонецФункции

// Вычисляет ширину текста значения
//
// Возвращаемое значение:
//   Число
Функция ШиринаТекстаЗначения() Экспорт
	Возврат _БазовыйКалькулятор.ШиринаТекстаЗначения();
КонецФункции

// Вычисляет ширину области логотипа
//
// Возвращаемое значение:
//   Число
Функция ШиринаОбластиЛоготипа() Экспорт
	Возврат _БазовыйКалькулятор.ШиринаОбластиЛоготипа();
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ШиринаСтрелки()
	Возврат ?(ШиринаЗначения() > 0, 6.5, 0);
КонецФункции

#КонецОбласти